# GetSubelement Method (String)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..GetSubelement Method (String)
Document Class See Also
---
Gets the subelement referenced by a unique id string.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public Subelement GetSubelement(
	string uniqueId
)
```

Visual Basic
---
```text
Public Function GetSubelement ( _
	uniqueId As String _
) As Subelement
```

Visual C++
---
```text
public:
Subelement^ GetSubelement(
	String^ uniqueId
)
```

# ### Parameters
uniqueId
    Type: System..::..String The unique id that identifies element or subelement.
* UniqueId
# ### Return Value
The subelement referenced by the input argument.
# Remarks
nullNothingnullptra null reference (Nothing in Visual Basic) will be returned if the input id string doesn't reference to a valid element or subelement.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Document Class
GetSubelement Overload
Autodesk.Revit.DB Namespace